__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 601, 64, 1)   0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 601, 64, 1)   0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 601, 64, 128) 1280        input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 601, 64, 128) 1280        input_2[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 601, 12, 128) 0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 601, 12, 128) 0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 601, 12, 128) 147584      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 601, 12, 128) 147584      max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 601, 6, 128)  0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 601, 6, 128)  0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 601, 6, 128)  147584      max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 601, 6, 128)  147584      max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 601, 3, 128)  0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 601, 3, 128)  0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 601, 3, 256)  0           max_pooling2d_3[0][0]            
                                                                 max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 601, 768)     0           concatenate_1[0][0]              
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, 601, 128)     688896      reshape_1[0][0]                  
__________________________________________________________________________________________________
bidirectional_2 (Bidirectional) (None, 601, 128)     197376      bidirectional_1[0][0]            
__________________________________________________________________________________________________
time_distributed_4 (TimeDistrib (None, 601, 1024)    132096      bidirectional_2[0][0]            
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 601, 1024)    0           time_distributed_4[0][0]         
__________________________________________________________________________________________________
time_distributed_5 (TimeDistrib (None, 601, 1024)    1049600     dropout_3[0][0]                  
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 601, 1024)    787456      reshape_1[0][0]                  
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 601, 1024)    0           time_distributed_5[0][0]         
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 601, 1024)    0           time_distributed_1[0][0]         
__________________________________________________________________________________________________
time_distributed_6 (TimeDistrib (None, 601, 1024)    1049600     dropout_4[0][0]                  
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 601, 1024)    1049600     dropout_1[0][0]                  
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 601, 1024)    0           time_distributed_6[0][0]         
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 601, 1024)    0           time_distributed_2[0][0]         
__________________________________________________________________________________________________
time_distributed_7 (TimeDistrib (None, 601, 9)       9225        dropout_5[0][0]                  
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, 601, 3)       3075        dropout_2[0][0]                  
==================================================================================================
Total params: 5,559,820
Trainable params: 5,559,820
Non-trainable params: 0
__________________________________________________________________________________________________
