_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 259, 64, 1)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 259, 64, 128)      1280      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 259, 12, 128)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 259, 12, 128)      147584    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 259, 6, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 259, 6, 128)       147584    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 259, 3, 128)       0         
_________________________________________________________________
reshape_1 (Reshape)          (None, 259, 384)          0         
_________________________________________________________________
bidirectional_1 (Bidirection (None, 259, 128)          393984    
_________________________________________________________________
bidirectional_2 (Bidirection (None, 259, 128)          197376    
_________________________________________________________________
time_distributed_1 (TimeDist (None, 259, 1024)         132096    
_________________________________________________________________
dropout_1 (Dropout)          (None, 259, 1024)         0         
_________________________________________________________________
time_distributed_2 (TimeDist (None, 259, 1024)         1049600   
_________________________________________________________________
dropout_2 (Dropout)          (None, 259, 1024)         0         
_________________________________________________________________
time_distributed_3 (TimeDist (None, 259, 1024)         1049600   
_________________________________________________________________
dropout_3 (Dropout)          (None, 259, 1024)         0         
_________________________________________________________________
time_distributed_4 (TimeDist (None, 259, 8)            8200      
=================================================================
Total params: 3,127,304
Trainable params: 3,127,304
Non-trainable params: 0
_________________________________________________________________
